Hi @kangasta 

Thanks for your answer. I can confirm that setting the 

```bash
export AWS_REQUEST_CHECKSUM_CALCULATION=when_required
export AWS_RESPONSE_CHECKSUM_VALIDATION=when_required
```

is working as workaround.

When executing `terraform apply` I get now

```bash
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # upcloud_managed_object_storage.this will be created
  + resource "upcloud_managed_object_storage" "this" {
      + configured_status = "started"
      + created_at        = (known after apply)
      + endpoint          = (known after apply)
      + id                = (known after apply)
      + labels            = {
          + "managed-by" = "terraform"
        }
      + name              = "example"
      + operational_state = (known after apply)
      + region            = "europe-2"
      + updated_at        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

upcloud_managed_object_storage.this: Creating...
upcloud_managed_object_storage.this: Still creating... [00m10s elapsed]
upcloud_managed_object_storage.this: Still creating... [00m20s elapsed]
upcloud_managed_object_storage.this: Still creating... [00m30s elapsed]
upcloud_managed_object_storage.this: Still creating... [00m40s elapsed]
upcloud_managed_object_storage.this: Creation complete after 46s [id=1212d204-98b4-4de8-9588-92c42348991b]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

and the state is saved in the UpCloud Object Storage bucket.

Thanks again for the help and I think we can close the issue